#pragma once

//Максимальное значение
#define _MAX_VALUE_DEFAULT  50  //угадываемое число по умолчанию
#define _MAX_VALUE_L1       10  //угадываемое число для уровня сложности 1
#define _MAX_VALUE_L2       50  //угадываемое число для уровня сложности 2
#define _MAX_VALUE_L3      100  //угадываемое число для уровня сложности 3

//
#define _MAX_ATTEMPTS       20  //число попыток угадать число
#define _NAME_LENGHT        30  //длина имени пользователя
#define _MAX_FILE_REC       10  //доступное кол-во записей в таблице рекордов
